In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [5]:
data = pd.Series([0.25, 0.5, 0.75, 1.0])
data

0    0.25
1    0.50
2    0.75
3    1.00
dtype: float64

In [6]:
data.values

array([0.25, 0.5 , 0.75, 1.  ])

In [7]:
data.index

RangeIndex(start=0, stop=4, step=1)

In [8]:
data[1]

0.5

In [9]:
data[1:3]

1    0.50
2    0.75
dtype: float64

# **The Pandas Series Object**

In [12]:
data = pd.Series([0.25, 0.5, 0.75, 1.0],
                index=['a','b','c','d'])

In [13]:
data

a    0.25
b    0.50
c    0.75
d    1.00
dtype: float64

In [14]:
data['b']

0.5

In [15]:
data = pd.Series([0.25, 0.5, 0.75, 1.0],
                index=[2,5,3,7])

In [16]:
data

2    0.25
5    0.50
3    0.75
7    1.00
dtype: float64

In [17]:
data[5]

0.5

In [22]:
population_dict = {'California' : 38332521,
                   'Texas': 26448193,
                   'New york': 19651127,
                   'Florida': 19552860,
                   'Illinois': 12882135}
population = pd.Series(population_dict)
population

California    38332521
Texas         26448193
New york      19651127
Florida       19552860
Illinois      12882135
dtype: int64

In [20]:
population['California']

38332521

In [23]:
population['California':'Illinois']

California    38332521
Texas         26448193
New york      19651127
Florida       19552860
Illinois      12882135
dtype: int64

In [25]:
#pd.Series(data, index=index)

In [26]:
pd.Series([2,4,6])

0    2
1    4
2    6
dtype: int64

In [27]:
pd.Series(5, index =[100,300,500])

100    5
300    5
500    5
dtype: int64

In [33]:
pd.Series({2:'a',1:'b',3:'c'})

2    a
1    b
3    c
dtype: object

In [34]:
pd.Series({2:'a',1:'b',3:'c'}, index=[3,2])

3    c
2    a
dtype: object

In [36]:
area_dict = {'California' : 423967,
                   'Texas': 695662,
                   'New york': 141297,
                   'Florida': 170312,
                   'Illinois': 149995}

area = pd.Series(area_dict)
area

California    423967
Texas         695662
New york      141297
Florida       170312
Illinois      149995
dtype: int64

# **The Pandas DataFrame Object**

In [37]:
states = pd.DataFrame({'population': population,
                       'area':area})
states

            population    area
California    38332521  423967
Texas         26448193  695662
New york      19651127  141297
Florida       19552860  170312
Illinois      12882135  149995

In [38]:
states.index

Index(['California', 'Texas', 'New york', 'Florida', 'Illinois'], dtype='object')

In [39]:
states.columns

Index(['population', 'area'], dtype='object')

In [40]:
states['area']

California    423967
Texas         695662
New york      141297
Florida       170312
Illinois      149995
Name: area, dtype: int64

In [42]:
#From a single Series Object

pd.DataFrame(population, columns=['population'])

            population
California    38332521
Texas         26448193
New york      19651127
Florida       19552860
Illinois      12882135

In [43]:
#From a list of dicts

data = [{'a':i, 'b': 2*i}
         for i in range(3)]
pd.DataFrame(data)

   a  b
0  0  0
1  1  2
2  2  4

In [44]:
#NaN = Not a Number

pd.DataFrame([{'a':1, 'b':2}, {'b':3, 'c':4}])

     a  b    c
0  1.0  2  NaN
1  NaN  3  4.0

In [45]:
#From a dictionary of Series objects
pd.DataFrame({'population':population,
              'area':area})

            population    area
California    38332521  423967
Texas         26448193  695662
New york      19651127  141297
Florida       19552860  170312
Illinois      12882135  149995

In [51]:
#From a two-dimensional Numpy array
pd.DataFrame = (np.random.rand(3,2),
                columns=['two', 'bar'],
                index=['a','b','c'])

SyntaxError: invalid syntax (<ipython-input-51-27c611558bb9>, line 3)

In [53]:
# From a Numpy structured array
A = np.zeros(3, dtype=[('A','i8'), ('B', 'f8')])
A

array([(0, 0.), (0, 0.), (0, 0.)], dtype=[('A', '<i8'), ('B', '<f8')])

In [54]:
pd.DataFrame(A)

   A    B
0  0  0.0
1  0  0.0
2  0  0.0

# **Pandas Index Object**

In [56]:
ind = pd.Index([2, 3, 5, 7, 11])
ind

Int64Index([2, 3, 5, 7, 11], dtype='int64')

In [57]:
ind[1]

3

In [58]:
ind[::2]

Int64Index([2, 5, 11], dtype='int64')

In [59]:
print(ind.size, ind.shape, ind.ndim, ind.dtype)

5 (5,) 1 int64

In [62]:
# Index as ordered set

indA = pd.Index([1,3,5,7,9])
indB = pd.Index([2,3,5,7,11])

indA & indB

<ipython-input-62-d390e47b6fe7>:6: FutureWarning: Index.__and__ operating as a set operation is deprecated, in the future this will be a logical operation matching Series.__and__.  Use index.intersection(other) instead
  indA & indB

Int64Index([3, 5, 7], dtype='int64')

In [63]:
indA|indB

<ipython-input-63-7c86bd7f65f6>:1: FutureWarning: Index.__or__ operating as a set operation is deprecated, in the future this will be a logical operation matching Series.__or__.  Use index.union(other) instead
  indA|indB

Int64Index([1, 2, 3, 5, 7, 9, 11], dtype='int64')

In [64]:
indA ^ indB

<ipython-input-64-3946b5999e74>:1: FutureWarning: Index.__xor__ operating as a set operation is deprecated, in the future this will be a logical operation matching Series.__xor__.  Use index.symmetric_difference(other) instead
  indA ^ indB

Int64Index([1, 2, 9, 11], dtype='int64')

# **Data Indexing and Selection**

In [65]:
data = pd.Series([0.25, 0.5, 0.75, 1.0],
                index=['a','b','c','d'])
data

a    0.25
b    0.50
c    0.75
d    1.00
dtype: float64

In [66]:
data['b']

0.5

In [67]:
'a' in data

True

In [68]:
data.keys()

Index(['a', 'b', 'c', 'd'], dtype='object')

In [70]:
list(data.items())

[('a', 0.25), ('b', 0.5), ('c', 0.75), ('d', 1.0)]

In [71]:
data.items()

In [72]:
data['e'] = 1.25
data

a    0.25
b    0.50
c    0.75
d    1.00
e    1.25
dtype: float64

In [73]:
# Slicing by explicit index
data['a':'c']

a    0.25
b    0.50
c    0.75
dtype: float64

In [74]:
# Slicing by implicit integer index
data[0:2]

a    0.25
b    0.50
dtype: float64

In [75]:
# Masking
data[(data > 0.3) & (data < 0.8)]

b    0.50
c    0.75
dtype: float64

In [76]:
# Fancy indexing
data [['a', 'e']]

a    0.25
e    1.25
dtype: float64

In [77]:
# Indexers : loc, iloc and ix

data = pd.Series(['a', 'b', 'c'], index = [1,3,5])
data

1    a
3    b
5    c
dtype: object

In [79]:
data.loc[1]

'a'

In [80]:
data.loc[1:3]

1    a
3    b
dtype: object

In [81]:
data.iloc[1]

'b'

In [82]:
data.iloc[1:3]

3    b
5    c
dtype: object

In [85]:
pop = pd.Series({'California' : 38332521,
                   'Texas': 26448193,
                   'New york': 19651127,
                   'Florida': 19552860,
                   'Illinois': 12882135})

area = pd.Series({'California' : 423967,
                   'Texas': 695662,
                   'New york': 141297,
                   'Florida': 170312,
                   'Illinois': 149995})

In [87]:
data = pd.DataFrame({'area':area, 'pop':pop})
data

              area       pop
California  423967  38332521
Texas       695662  26448193
New york    141297  19651127
Florida     170312  19552860
Illinois    149995  12882135

In [88]:
data['area']

California    423967
Texas         695662
New york      141297
Florida       170312
Illinois      149995
Name: area, dtype: int64

In [89]:
data['pop']

California    38332521
Texas         26448193
New york      19651127
Florida       19552860
Illinois      12882135
Name: pop, dtype: int64

In [90]:
data.area

California    423967
Texas         695662
New york      141297
Florida       170312
Illinois      149995
Name: area, dtype: int64

In [91]:
data.pop

<bound method DataFrame.pop of               area       pop
California  423967  38332521
Texas       695662  26448193
New york    141297  19651127
Florida     170312  19552860
Illinois    149995  12882135>

In [92]:
data.area is data['area']

True

In [93]:
data.pop is data['pop']

False

In [94]:
data['pop'] is data['pop']

True

In [96]:
data['density'] = data['pop']/data['area']
data

              area       pop     density
California  423967  38332521   90.413926
Texas       695662  26448193   38.018740
New york    141297  19651127  139.076746
Florida     170312  19552860  114.806121
Illinois    149995  12882135   85.883763

In [97]:
data.values

array([[4.23967000e+05, 3.83325210e+07, 9.04139261e+01],
       [6.95662000e+05, 2.64481930e+07, 3.80187404e+01],
       [1.41297000e+05, 1.96511270e+07, 1.39076746e+02],
       [1.70312000e+05, 1.95528600e+07, 1.14806121e+02],
       [1.49995000e+05, 1.28821350e+07, 8.58837628e+01]])

In [98]:
data.T

           California         Texas      New york       Florida      Illinois
area     4.239670e+05  6.956620e+05  1.412970e+05  1.703120e+05  1.499950e+05
pop      3.833252e+07  2.644819e+07  1.965113e+07  1.955286e+07  1.288214e+07
density  9.041393e+01  3.801874e+01  1.390767e+02  1.148061e+02  8.588376e+01

In [100]:
data.values[0]

array([4.23967000e+05, 3.83325210e+07, 9.04139261e+01])

In [101]:
data['area']

California    423967
Texas         695662
New york      141297
Florida       170312
Illinois      149995
Name: area, dtype: int64

In [102]:
data.iloc[:3,:2]

              area       pop
California  423967  38332521
Texas       695662  26448193
New york    141297  19651127

In [103]:
data.loc[:'Illinois',:'pop']

              area       pop
California  423967  38332521
Texas       695662  26448193
New york    141297  19651127
Florida     170312  19552860
Illinois    149995  12882135

In [105]:
data.ix[:3,:'pop']

AttributeError: 'DataFrame' object has no attribute 'ix'

In [106]:
data.loc[data.density > 100, ['pop', 'density']]

               pop     density
New york  19651127  139.076746
Florida   19552860  114.806121

In [107]:
data.iloc[0,2] = 90
data

              area       pop     density
California  423967  38332521   90.000000
Texas       695662  26448193   38.018740
New york    141297  19651127  139.076746
Florida     170312  19552860  114.806121
Illinois    149995  12882135   85.883763

In [108]:
# Additional indexing conventions
data['Florida':'Illinois']

            area       pop     density
Florida   170312  19552860  114.806121
Illinois  149995  12882135   85.883763

In [109]:
data[1:3]

            area       pop     density
Texas     695662  26448193   38.018740
New york  141297  19651127  139.076746

In [110]:
data[data.density>100]

            area       pop     density
New york  141297  19651127  139.076746
Florida   170312  19552860  114.806121

# **Missing Data in Pandas**

In [111]:
#None : Pythonic missing data

vals1 = np.array([1, None, 3, 4])
vals1

array([1, None, 3, 4], dtype=object)

In [112]:
for dtype in ['object', 'int']:
    print("dtype =", dtype)
    %timeit np.arange(1E6, dtype=dtype).sum()
    print()

dtype = object
43.8 ms  2.11 ms per loop (mean  std. dev. of 7 runs, 10 loops each)

dtype = int
1.35 ms  15.8 s per loop (mean  std. dev. of 7 runs, 1000 loops each)

In [ ]:
#NaN : Missing numerical data

In [114]:
vals2 = np.array([1, np.nan, 3, 4])
vals2
vals2.dtype

dtype('float64')

In [116]:
vals2.sum(), vals2.min(), vals2.max()

(nan, nan, nan)

In [117]:
np.nansum(vals2), np.nanmin(vals2), np.nanmax(vals2)

(8.0, 1.0, 4.0)

In [118]:
# NaN and None in Pandas

pd.Series([1, np.nan, 3, None])

0    1.0
1    NaN
2    3.0
3    NaN
dtype: float64

In [119]:
x= pd.Series(range(2), dtype = int)
x

0    0
1    1
dtype: int32

In [120]:
x[0] = None

In [121]:
x

0    NaN
1    1.0
dtype: float64

### Operating on Null Values

In [ ]:
#isnull()  - Generate a Boolean mask indicating missing values
#notnull() - opposite of isnull
#dropna()  - Return a filtered version of the data
#fillna()  - Return a copy of the data with missing values filled or imputed

In [126]:
# detecting null values

data = pd.Series([1, np.nan, 'hello', None])

In [123]:
data.isnull()

0    False
1     True
2    False
3     True
dtype: bool

In [127]:
data[data.notnull()]

0        1
2    hello
dtype: object

In [128]:
#Dropping null values

data.dropna()

0        1
2    hello
dtype: object

In [129]:
df = pd.DataFrame([[1, np.nan, 2],
                   [2, 3, 5],
                   [np.nan, 4, 6]])
df

     0    1  2
0  1.0  NaN  2
1  2.0  3.0  5
2  NaN  4.0  6

In [130]:
df.dropna()

     0    1  2
1  2.0  3.0  5

In [131]:
df.dropna(axis='columns')

   2
0  2
1  5
2  6

In [132]:
df[3] = np.nan
df

     0    1  2   3
0  1.0  NaN  2 NaN
1  2.0  3.0  5 NaN
2  NaN  4.0  6 NaN

In [133]:
df.dropna(axis='columns', how='all')

     0    1  2
0  1.0  NaN  2
1  2.0  3.0  5
2  NaN  4.0  6

In [137]:
df.dropna(axis='rows', thresh=3)

     0    1  2   3
1  2.0  3.0  5 NaN

In [140]:
# Filling null values
data = pd.Series([1, np.nan, 2, None, 3], index=list('abcde'))
data

a    1.0
b    NaN
c    2.0
d    NaN
e    3.0
dtype: float64

In [141]:
data.fillna(0)

a    1.0
b    0.0
c    2.0
d    0.0
e    3.0
dtype: float64

In [142]:
#forward-fill
data.fillna(method='ffill')

a    1.0
b    1.0
c    2.0
d    2.0
e    3.0
dtype: float64

In [143]:
data.fillna(method='bfill')

a    1.0
b    2.0
c    2.0
d    3.0
e    3.0
dtype: float64

In [144]:
df

     0    1  2   3
0  1.0  NaN  2 NaN
1  2.0  3.0  5 NaN
2  NaN  4.0  6 NaN

In [148]:
df.fillna(method='ffill', axis=1)

     0    1    2    3
0  1.0  1.0  2.0  2.0
1  2.0  3.0  5.0  5.0
2  NaN  4.0  6.0  6.0

# **Hierarchical Indexing(Multi Indexing)**

In [152]:
index = [('California', 2000), ('California', 2010),
         ('New York', 2000), ('New York', 2010),
         ('Texas', 2000), ('Texas', 2010)]

populations = [33871648, 37253956,
               18976457, 19378102,
               20851820, 25145561]

pop = pd.Series(populations, index=index)
pop

(California, 2000)    33871648
(California, 2010)    37253956
(New York, 2000)      18976457
(New York, 2010)      19378102
(Texas, 2000)         20851820
(Texas, 2010)         25145561
dtype: int64

In [153]:
pop[('California', 2000):('Texas',2000)]

(California, 2000)    33871648
(California, 2010)    37253956
(New York, 2000)      18976457
(New York, 2010)      19378102
(Texas, 2000)         20851820
dtype: int64

In [157]:
pop[[i for i in pop.index if i[1]==2010]]

(California, 2010)    37253956
(New York, 2010)      19378102
(Texas, 2010)         25145561
dtype: int64

In [158]:
# The better way : Pandas Multiindex
index = pd.MultiIndex.from_tuples(index)
index

MultiIndex([('California', 2000),
            ('California', 2010),
            (  'New York', 2000),
            (  'New York', 2010),
            (     'Texas', 2000),
            (     'Texas', 2010)],
           )

In [159]:
pop = pop.reindex(index)
pop

California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

In [161]:
pop[:,2010]

California    37253956
New York      19378102
Texas         25145561
dtype: int64

In [162]:
# Multiindex as extra dimension
pop_df = pop.unstack()
pop_df

                2000      2010
California  33871648  37253956
New York    18976457  19378102
Texas       20851820  25145561

In [163]:
pop_df.stack()

California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

In [164]:
pop_df = pd.DataFrame({'total': pop,
                       'under18': [9267089, 9284094,
                                   4687374, 4318033,
                                   5906301, 6879014]})
pop_df

                    total  under18
California 2000  33871648  9267089
           2010  37253956  9284094
New York   2000  18976457  4687374
           2010  19378102  4318033
Texas      2000  20851820  5906301
           2010  25145561  6879014

In [165]:
f_u18 = pop_df['under18']/pop_df['total']
f_u18

California  2000    0.273594
            2010    0.249211
New York    2000    0.247010
            2010    0.222831
Texas       2000    0.283251
            2010    0.273568
dtype: float64

In [168]:
f_u18.unstack()

                2000      2010
California  0.273594  0.249211
New York    0.247010  0.222831
Texas       0.283251  0.273568

In [170]:
#Methods of Multiindex Creation

df = pd.DataFrame(np.random.rand(4,2),
                  index=[['a','a','b','b'], [1,2,1,2]],
                  columns =['data1','data2'])
df

        data1     data2
a 1  0.029216  0.528474
  2  0.085866  0.143011
b 1  0.840192  0.452980
  2  0.154538  0.649052

In [171]:
# Explicit Multiindex contructors
pd.MultiIndex.from_arrays([['a','a','b','b'], [1,2,1,2]])

MultiIndex([('a', 1),
            ('a', 2),
            ('b', 1),
            ('b', 2)],
           )

In [172]:
#Multiindex level names
pop.index.names=['state','year']
pop

state       year
California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

In [193]:
# MultiIndex for columns

#hierarchical indices and columns
index = pd.MultiIndex.from_product([[2013,2014],[1,2]],
                                   names=['Year','Visit'])
columns = pd.MultiIndex.from_product([['Bob','Guido','Sue'], ['HR','Temp']],
                                     names=['Subject', 'Type'])

# mock some data
data = np.round(np.random.randn(4,6),1)
data[:,::2] *=10
data +=37

#create the dataframe
health_data = pd.DataFrame(data, index=index, columns=columns)
health_data

Subject      Bob       Guido         Sue
Type          HR  Temp    HR  Temp    HR  Temp
Year Visit
2013 1      43.0  37.8  32.0  38.5  31.0  37.9
     2      49.0  37.1  33.0  37.3  36.0  39.5
2014 1      38.0  36.6  20.0  36.5  24.0  36.5
     2      25.0  38.0  40.0  38.5  36.0  36.4

In [177]:
health_data['Sue']

Type          HR  Temp
Year Visit
2013 1      26.0  38.2
     2      43.0  37.2
2014 1      37.0  36.4
     2      59.0  36.7

# Indexing and Slicing a MultiIndex

In [178]:
pop

state       year
California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

In [180]:
pop['California',2000]

33871648

In [181]:
pop['California']

year
2000    33871648
2010    37253956
dtype: int64

In [182]:
pop.loc['California':'New York']

state       year
California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
dtype: int64

In [183]:
pop[:,2000]

state
California    33871648
New York      18976457
Texas         20851820
dtype: int64

In [185]:
pop[pop>22000000]

state       year
California  2000    33871648
            2010    37253956
Texas       2010    25145561
dtype: int64

In [186]:
pop[['California','Texas']]

state       year
California  2000    33871648
            2010    37253956
Texas       2000    20851820
            2010    25145561
dtype: int64

In [187]:
# Multiply Indexed DataFrames
health_data

Subject      Bob       Guido         Sue
Type          HR  Temp    HR  Temp    HR  Temp
Year Visit
2013 1      45.0  37.1  40.0  39.4  26.0  38.2
     2      35.0  37.6  34.0  36.8  43.0  37.2
2014 1      52.0  37.1  31.0  35.1  37.0  36.4
     2      58.0  35.8  52.0  38.1  59.0  36.7

In [194]:
health_data['Guido','HR']

Year  Visit
2013  1        32.0
      2        33.0
2014  1        20.0
      2        40.0
Name: (Guido, HR), dtype: float64

In [195]:
health_data.iloc[:2,:2]

Subject      Bob
Type          HR  Temp
Year Visit
2013 1      43.0  37.8
     2      49.0  37.1

In [196]:
health_data.loc[:,('Bob','HR')]

Year  Visit
2013  1        43.0
      2        49.0
2014  1        38.0
      2        25.0
Name: (Bob, HR), dtype: float64

In [200]:
idx = pd.IndexSlice
health_data.loc[idx[:,1],idx[:,'HR']]

Subject      Bob Guido   Sue
Type          HR    HR    HR
Year Visit
2013 1      43.0  32.0  31.0
2014 1      38.0  20.0  24.0

# Rearranging Multi-Indices

In [202]:
index = pd.MultiIndex.from_product([['a','c','b'], [1,2]])
data = pd.Series(np.random.rand(6), index=index)
data.index.names = ['char','int']
data

char  int
a     1      0.273543
      2      0.703972
c     1      0.864959
      2      0.563334
b     1      0.881296
      2      0.288459
dtype: float64

In [203]:
data = data.sort_index()
data

char  int
a     1      0.273543
      2      0.703972
b     1      0.881296
      2      0.288459
c     1      0.864959
      2      0.563334
dtype: float64

In [205]:
data['a':'b']

char  int
a     1      0.273543
      2      0.703972
b     1      0.881296
      2      0.288459
dtype: float64

In [206]:
pop.unstack(level=0)

state  California  New York     Texas
year
2000     33871648  18976457  20851820
2010     37253956  19378102  25145561

In [207]:
pop.unstack(level=1)

year            2000      2010
state
California  33871648  37253956
New York    18976457  19378102
Texas       20851820  25145561

In [209]:
pop.unstack().stack()

state       year
California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

In [210]:
# Index setting and resetting
pop_flat = pop.reset_index(name = 'population')
pop_flat

        state  year  population
0  California  2000    33871648
1  California  2010    37253956
2    New York  2000    18976457
3    New York  2010    19378102
4       Texas  2000    20851820
5       Texas  2010    25145561

In [212]:
pop_flat.set_index(['state','year'])

                 population
state      year
California 2000    33871648
           2010    37253956
New York   2000    18976457
           2010    19378102
Texas      2000    20851820
           2010    25145561

In [213]:
health_data

Subject      Bob       Guido         Sue
Type          HR  Temp    HR  Temp    HR  Temp
Year Visit
2013 1      43.0  37.8  32.0  38.5  31.0  37.9
     2      49.0  37.1  33.0  37.3  36.0  39.5
2014 1      38.0  36.6  20.0  36.5  24.0  36.5
     2      25.0  38.0  40.0  38.5  36.0  36.4

In [214]:
data_mean = health_data.mean(level='Year')
data_mean

Subject   Bob        Guido         Sue
Type       HR   Temp    HR  Temp    HR   Temp
Year
2013     46.0  37.45  32.5  37.9  33.5  38.70
2014     31.5  37.30  30.0  37.5  30.0  36.45

In [218]:
data_mean.mean(axis=1, level='Type')

Type         HR       Temp
Year
2013  37.333333  38.016667
2014  30.500000  37.083333

# Combining Datasets: Concat and Append

In [223]:
def make_df(cols, ind):
    """Quickly make a DataFrame"""
    data = {c: [str(c)+str(i) for i in ind]
            for c in cols}
    return pd.DataFrame(data, ind)

# Example DataFrame
make_df('ABC',range(3))

    A   B   C
0  A0  B0  C0
1  A1  B1  C1
2  A2  B2  C2